


	New 4 Current job + new Job


	https://www.elastic.co/security-labs/dismantling-smart-app-control

		LNK stomping may have many variants, making signature-based detection on LNK files difficult. However, they should all trigger a similar behavioral signal- explorer.exe overwriting an LNK file. This is especially anomalous in the downloads folder or when the LNK has the Mark of the Web.

file where event.action == "overwrite" and file.extension : "lnk" and
 process.name : "explorer.exe" and process.thread.Ext.call_stack_summary : "ntdll.dll|*|windows.storage.dll|shell32.dll|*" and
 (
  file.path : ("?:\\Users\\*\\Downloads\\*.lnk", "?:\\Users\\*\\AppData\\Local\\Temp\\*.lnk") or
  file.Ext.windows.zone_identifier == 3
  )

		https://kbi.media/press-release/grimresource-microsoft-management-console-for-initial-access-and-evasion/

		https://github.com/ipSlav/DirtyCLR/tree/7b1280fee780413d43adbad9f4c2a9ce7ed9f29e

		https://github.com/ipSlav/DirtyCLR/tree/7b1280fee780413d43adbad9f4c2a9ce7ed9f29e



		(Good Read for offensive + Defensive )

	https://www.mdsec.co.uk/2024/02/active-directory-enumeration-for-red-teams/

		https://medium.com/@browninfosecguy/an-introduction-to-powerview-bdfd953f2c4c

	

	Job

	https://emp.jobylon.com/jobs/179713-withsecure-threat-hunter/

	https://www.withsecure.com/en/about-us/careers-at-withsecure/open-jobs

	https://tenendo.com/red-team-operator/


Date: 12 th August 2024


https://github.com/ricardojoserf/TrickDump
https://offensiveforce.com/CRTO-Review-2024
https://github.com/zimnyaa/beepsyscall/

https://tishina.in/home

https://janbakker.tech/how-to-set-up-evilginx-to-phish-office-365-credentials/

https://www.youtube.com/watch?v=tG8WacArJsE

( thread Hijacking )



Date: 20 th August 2024


https://github.com/sevagas/Advanced_Initial_access_in_2024_OffensiveX/blob/main/breach_the_gates_extended.pdf

System Calls For Hackers

https://www.youtube.com/watch?v=LLRwsh2oA2Y&t=1518s

https://github.com/RoseSecurity/Red-Teaming-TTPs



Date: 21 'st August 2024

https://www.vergiliusproject.com/kernels/x64/windows-11/23h2/_OBJECT_ATTRIBUTES

Date 22 nd August 2024

https://www.pentestpartners.com/security-blog/living-off-the-land-with-bluetooth-pan/

https://www.aerospacevillage.org/mission
https://github.com/BC-SECURITY/Empire


On today's episode of "do you know your tools", did you know that both CrackMapExec and NetExec both make TWO connections to each target?







		
